# Реализуйте алгоритм нахождения(генерации) рандомного(случайного) числа.(Не используя библиотеки связанные с рандомом)

import time

print(str(time.time()).split('.')[1][-3:])
